
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_117 (Conv2D)          (None, None, None, 64)    3136      
_________________________________________________________________
conv2d_118 (Conv2D)          (None, None, None, 64)    65600     
_________________________________________________________________
conv2d_119 (Conv2D)          (None, None, None, 64)    65600     
_________________________________________________________________
conv2d_120 (Conv2D)          (None, None, None, 64)    65600     
_________________________________________________________________
batch_normalization_12 (Batc (None, None, None, 64)    256       
_________________________________________________________________
max_pooling2d_66 (MaxPooling (None, None, None, 64)    0         
_________________________________________________________________
conv2d_121 (Conv2D)          (None, None, None, 128)   131200    
_________________________________________________________________
conv2d_122 (Conv2D)          (None, None, None, 128)   262272    
_________________________________________________________________
conv2d_123 (Conv2D)          (None, None, None, 128)   262272    
_________________________________________________________________
conv2d_124 (Conv2D)          (None, None, None, 128)   262272    
_________________________________________________________________
batch_normalization_13 (Batc (None, None, None, 128)   512       
_________________________________________________________________
max_pooling2d_67 (MaxPooling (None, None, None, 128)   0         
_________________________________________________________________
conv2d_125 (Conv2D)          (None, None, None, 256)   524544    
_________________________________________________________________
conv2d_126 (Conv2D)          (None, None, None, 256)   1048832   
_________________________________________________________________
conv2d_127 (Conv2D)          (None, None, None, 256)   1048832   
_________________________________________________________________
conv2d_128 (Conv2D)          (None, None, None, 256)   1048832   
_________________________________________________________________
batch_normalization_14 (Batc (None, None, None, 256)   1024      
_________________________________________________________________
max_pooling2d_68 (MaxPooling (None, None, None, 256)   0         
_________________________________________________________________
flatten_22 (Flatten)         (None, None)              0         
_________________________________________________________________
dense_50 (Dense)             (None, 256)               16777472  
_________________________________________________________________
dropout_28 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_29 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 21,635,076
Trainable params: 21,634,180
Non-trainable params: 896
_________________________________________________________________
None
[INFO] OK terminated...
Tempo de operação: 1 day, 13:49:50
